Xmausix/FusionRT/stm32f4xx_hal_conf.h
#pragma once

#define HAL_MODULE_ENABLED
#define HAL_GPIO_MODULE_ENABLED
#define HAL_UART_MODULE_ENABLED
#define HAL_RCC_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED

#define HSE_VALUE    8000000U
#define HSI_VALUE    16000000U
#define HSE_STARTUP_TIMEOUT  100U
#define LSE_STARTUP_TIMEOUT  5000U
#define LSE_VALUE    32768U
#define EXTERNAL_CLOCK_VALUE  12288000U
#define VDD_VALUE    3300U
#define TICK_INT_PRIORITY  0x0FU
#define USE_RTOS     0U
#define PREFETCH_ENABLE  1U
#define INSTRUCTION_CACHE_ENABLE  1U
#define DATA_CACHE_ENABLE  1U

#include "stm32f4xx_hal_def.h"
#include "stm32f4xx_hal_rcc.h"
#include "stm32f4xx_hal_gpio.h"
#include "stm32f4xx_hal_uart.h"
#include "stm32f4xx_hal_cortex.h"